In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
countries = ['USA','Nigeria','France','Ghana']

In [4]:
my_data = [100,200,300,400]

In [5]:
pd.Series(my_data,countries)

USA        100
Nigeria    200
France     300
Ghana      400
dtype: int64

In [6]:
np_arr = np.array(my_data)

In [7]:
pd.Series(np_arr)

0    100
1    200
2    300
3    400
dtype: int32

In [8]:
my_dict = {'a':50,'b':60,'c':70,'d':80}

In [9]:
pd.Series(my_dict)

a    50
b    60
c    70
d    80
dtype: int64

In [10]:
np_arr = np.array(my_data)

In [11]:
pd.Series(np_arr)

0    100
1    200
2    300
3    400
dtype: int32

In [12]:
series1 = pd.Series([1,2,3,4],['london','HongKong','Usa','For'])

In [13]:
series1['london']

1

In [14]:
series1 = pd.Series(['london','HongKong','Usa','For'],[1,2,3,4])

In [15]:
series1

1      london
2    HongKong
3         Usa
4         For
dtype: object

In [16]:
series1 = pd.Series([1,2,3,4],['london','HongKong','Usa','For'])
series2 = pd.Series([1,3,6,4],['london','and','lugae','For'])

In [18]:
series1 + series2

For         8.0
HongKong    NaN
Usa         NaN
and         NaN
london      2.0
lugae       NaN
dtype: float64

In [19]:
df = {'name':pd.Series(['jon','Asron','Todd'],index=['a','b','c']),
        'age':pd.Series(['39','34','32','33'],index = ['a','b','c','d']),
      'natiionality':pd.Series(['us','china','us'],['a','b','c'])
     }
pd.DataFrame(df)

  age   name natiionality
a  39    jon           us
b  34  Asron        china
c  32   Todd           us
d  33    NaN          NaN